<a href="https://colab.research.google.com/github/MirzaSaniya/Accessing-Python-Library-Saniya-Mirza/blob/main/Python_Exploratory_Data_Analysis_Saniya_Mirza.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Python Exploratory Data Analysis Saniya Mirza
 * Numpy
    * Numpy is a python library for numeric processing
    * Efficient way to deal with arrays and matrices
    * NDArray allows operation on entire arrays, matrices
 * Pandas
    * Provides classes to read, manipulate and analyze tabular data
    * Important structures
      * Series
      * DataFrame
 * Tabular data
    * Tabular or relational data is organized into rows and columns
    * Rows contain individual elements
    * Columns contain properties of each element
 * Data extraction
    * Local file
    * CSV
    * Excel
    * Databases
    * Web scraping

### NDArray
* ndarray (n-dimensional) is the primary data structure in NumPy
* elements are all of the same type
* supports multiple numeric types
  * np.float32
* Unlike python lists, numpy arrays have attributes
  * ndim - number of dimensions
  * shape - shape of the array
  * size - total elements
  * dtype - data type of the elements
* supports operators
* allows fast indexing, slicing and reshaping

In [ ]:
import numpy as np
x = [1, 2, 3]
npx = np.array(x) # First convert x into numeric array
dx  = 2 * npx  # Note lack of list comprehension
print(dx)

[2 4 6]

### Pandas
* Pandas is built around two collection objects
  * DataFrame
    * Tabular data structure
    * Consists of
       * columns (each of which is a series)
       * index: name(s) attached to rows
       * Can be accessed as collection of rows and/or columns
  * Series  
    * Similar to a Numpy array
    * Consists of a name, values and *index*
      * Numpy arrays do not have an index
    * The values and indices are themselves Numpy arrays

In [ ]:
import pandas as pd
data = [['AMR',75],['BOB',21],['CBR',30],['DOG',28], ['GOD', 40]]
df = pd.DataFrame(data,columns=['Initials','Age'])
print (df)

  Initials  Age
0      AMR   75
1      BOB   21
2      CBR   30
3      DOG   28
4      GOD   40

In [ ]:
df.dtypes

Initials    object
Age          int64
dtype: object

In [ ]:
type(df.index)

pandas.core.indexes.range.RangeIndex

In [ ]:
#Begin Week 3

## Week 3

* Joining and unioning data frames
    * Inner and outer (left, right) Joins
    * Unions ("vertical" joins)

* Data Aggregation
    * Aggregation
    * Summary statistics
    * Group statistics
    * Grouping and aggregation

### Merging dataframes
* Ways to add data
  * Adding columns
      * requires numbers of rows to match
  ```python
      df['new_column'] = 2 * df['old_column']
  ```
  * Adding rows
      * requires number of columns to match     
  ```python
     df = pd.concat([df1, df2], axis=0)
  ```
  * Merging is another way to add data to existing data frame
      * requires one or more columns to exist in both data frames
      * Similar to SQL join operations

In [ ]:
# Consider example of a dataframe containing names and profession
# We would like to join this with another data frame consisting of
# names and ages
import pandas as pd
profession_df = pd.DataFrame([
    {'name': 'Fidel Rodriguez', 'profession': 'Comedian'},
    {'name': 'Tom Brady', 'profession': 'Athlete'},
    {'name': 'Bill Nye', 'profession': 'TV personality'},
    {'name': 'Bill Gates', 'profession': 'Philanthropist'}
])
profession_df

              name      profession
0  Fidel Rodriguez        Comedian
1        Tom Brady         Athlete
2         Bill Nye  TV personality
3       Bill Gates  Philanthropist

In [ ]:
# data frame containing names and ages
age_df = pd.DataFrame([
    {'name': 'Tom Brady', 'age': 40},
    {'name': 'Bill Nye', 'age': 62},
    {'name': 'Thomas Obama', 'age': 56}
])
age_df

           name  age
0     Tom Brady   40
1      Bill Nye   62
2  Thomas Obama   56

In [ ]:
# We can merge the two dataframes based on a common column 'name'
profession_df.merge(age_df, on=['name'])

        name      profession  age
0  Tom Brady         Athlete   40
1   Bill Nye  TV personality   62

### Types of joins
* By default, merge() function assumes that join is 'inner'
* Inner join
  * The output contains rows present in both dataframes
* Left join
  * Output contains all rows from the **left** data frame
* Right join
  * Output contains all rows from the **right** data frame
* Outer join
  * Output contains all rows from **both** the data frames.

In [ ]:
# Recall
# Bill Gates is present only in the 'left'(profession_df) dataframe
# Barack Obama is present only in the 'right'(age_df) dataframe
profession_df.merge(age_df, left_on='name', right_on='name')

        name      profession  age
0  Tom Brady         Athlete   40
1   Bill Nye  TV personality   62

In [ ]:
# Recall
# Bill Gates is present only in the 'left'(profession_df) dataframe
# Barack Obama is present only in the 'right'(age_df) dataframe
profession_df.merge(age_df, how='left', on ='name')

              name      profession   age
0  Fidel Rodriguez        Comedian   NaN
1        Tom Brady         Athlete  40.0
2         Bill Nye  TV personality  62.0
3       Bill Gates  Philanthropist   NaN

In [ ]:
# Recall
# Bill Gates is present only in the 'left'(profession_df) dataframe
# Barack Obama is present only in the 'right'(age_df) dataframe
profession_df.merge(age_df, how='right', on ='name')

           name      profession  age
0     Tom Brady         Athlete   40
1      Bill Nye  TV personality   62
2  Thomas Obama             NaN   56

In [ ]:
# Recall
# Bill Gates is present only in the 'left'(profession_df) dataframe
# Barack Obama is present only in the 'right'(age_df) dataframe
profession_df.merge(age_df, how='outer', on ='name')

              name      profession   age
0  Fidel Rodriguez        Comedian   NaN
1        Tom Brady         Athlete  40.0
2         Bill Nye  TV personality  62.0
3       Bill Gates  Philanthropist   NaN
4     Thomas Obama             NaN  56.0

#### Merging multiple columns
* Dataframes can be merged based on multiple columns
* on,left_on,right_on also take a list of columns as arguments

In [ ]:
# In this example we will merge profession dataframe with age dataframe
# based on two columns ['first_name', 'last_name']
profession_df = pd.DataFrame([
    {'first_name': 'Sharat', 'last_name': 'Chikkerur', 'profession': 'Data scientist'},
    {'first_name': 'Tom', 'last_name': 'Brady', 'profession': 'Athlete'},
    {'first_name': 'Bill', 'last_name': 'Nye', 'profession': 'TV personality'},
    {'first_name': 'Bill', 'last_name': 'Gates', 'profession': 'Philanthropist'}
])
profession_df

  first_name  last_name      profession
0     Sharat  Chikkerur  Data scientist
1        Tom      Brady         Athlete
2       Bill        Nye  TV personality
3       Bill      Gates  Philanthropist

In [ ]:
age_df = pd.DataFrame([
    {'first_name': 'Sharat', 'last_name': 'Chikkerur', 'age': 38},
    {'first_name': 'Tom', 'last_name': 'Brady', 'age': 40},
    {'first_name': 'Bill', 'last_name': 'Nye', 'age': 62},
    {'first_name': 'Barack', 'last_name': 'Obama', 'age': 56}
])
age_df

  first_name  last_name  age
0     Sharat  Chikkerur   38
1        Tom      Brady   40
2       Bill        Nye   62
3     Barack      Obama   56

In [ ]:
# Joins can be done using multiple columns
profession_df.merge(age_df, how='outer', on =['first_name', 'last_name'])

  first_name  last_name      profession   age
0     Sharat  Chikkerur  Data scientist  38.0
1        Tom      Brady         Athlete  40.0
2       Bill        Nye  TV personality  62.0
3       Bill      Gates  Philanthropist   NaN
4     Barack      Obama             NaN  56.0

In [ ]:
import pandas as pd

### Aggregating data

#### Global aggregation
* Both Series and DataFrames support global aggregation functions
  * min()
  * max()
  * std()
  * sum()
  * mean() etc.
* Non numeric columsn may be omitted in the global summary

### Global aggregation example

```python
df = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')
# display sum
df.sum()

# display mean
df.mean()

# display min and max
df.min()
df.max()

# display std
df.std()
```

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB
None

In [ ]:
df.sum()

sepal_length                                                876.5
sepal_width                                                 458.6
petal_length                                                563.7
petal_width                                                 179.9
species         setosasetosasetosasetosasetosasetosasetosaseto...
dtype: object

In [ ]:
df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [ ]:
df.min()

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [ ]:
df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [ ]:
df.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

#### Groupby
* groupby() allows you to generate subtotals by one more columns
    * aggregates data for each change in group-by columns
    * For example,
        * generate average height by age
        * Average revenue by month of the year
        * Average revenue by region etc.

In [ ]:
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [ ]:
for species in df['species'].unique():
    print("Species: {0}".format(species))
    print(df.loc[df['species']==species].mean())

Species: setosa
sepal_length    5.006
sepal_width     3.428
petal_length    1.462
petal_width     0.246
dtype: float64
Species: versicolor
sepal_length    5.936
sepal_width     2.770
petal_length    4.260
petal_width     1.326
dtype: float64
Species: virginica
sepal_length    6.588
sepal_width     2.974
petal_length    5.552
petal_width     2.026
dtype: float64

In [ ]:
df.groupby('species').mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

### Split-apply-combine
```python
df.groupby('species').mean()
```
* Split apply combine is a common analysis task
* In the example,
  * We split the dataframe by value of 'species' column
  * For each split we computed the mean
  * Combined the means into a results data frame

#### Generalized aggregation
* Pandas allows generalized aggregation methods through agg() function
* We can compute quantities other than mean(), min(), max() etc.
* Example
```python
   df.groupby('species').agg(
       {
           'median': np.median,
           'variance': np.var
       }
   )
```

In [ ]:
import numpy as np
df.groupby('species').agg([np.median, np.var])

           sepal_length           sepal_width  ... petal_length petal_width
                 median       var      median  ...          var      median       var
species                                        ...
setosa              5.0  0.124249         3.4  ...     0.030159         0.2  0.011106
versicolor          5.9  0.266433         2.8  ...     0.220816         1.3  0.039106
virginica           6.5  0.404343         3.0  ...     0.304588         2.0  0.075433

[3 rows x 8 columns]

In [ ]:
df.groupby('species').agg(lambda x: x.sum())

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        171.4          73.1         12.3
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3

In [ ]:
df.groupby('species').sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        171.4          73.1         12.3
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3

In [ ]:
#In-Class Exericse:
#Apply these techniques to the airbnb data set that we reviewed last week!
data_path = "https://docs.google.com/spreadsheets/d/e/2PACX-1vRTZ0jj-ClS7G07Gux6UVBz5iKxferpaOFZuwkCGxuTzE_jS68Bygv0cRY0fh-aJFRscbz9iO1K3XQe/pub?gid=744086987&single=true&output=csv"
df_airbnb = pd.read_csv(data_path)

In [ ]:
#In-Class Exercise 2:
#Apply these techniques to the data set at the following address: https://github.com/fivethirtyeight/data/blob/master/airline-safety/airline-safety.csv and share something interesting with the class
#Note: The URL above cannot be loaded directly, figure out a way to get the data set into Python / Colab

In [ ]:
import pandas_datareader as pdr
start_date = "1990-01-01"
end_date = "2019-11-01"

spy_data_temp = pdr.DataReader('SPY', 'yahoo', start_date, end_date)

In [ ]:
spy_data_temp = spy_data_temp['Adj Close']
spy_data_daily_temp = pd.DataFrame(spy_data_temp)
spy_data_daily_temp.columns = ['SPY']

In [ ]:
spy_data_temp.head(3)

Date
1993-01-29    26.583992
1993-02-01    26.773048
1993-02-02    26.829773
Name: Adj Close, dtype: float64

In [ ]:
spy_data_daily_temp.head(1)

                  SPY
Date
1995-01-03  29.153341

In [ ]:
type(spy_data_daily_temp.index)

pandas.core.indexes.datetimes.DatetimeIndex